detonation_initiation_convergence_order_test/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    // left
    // {
    //     type            waveTransmissive;
    //     gamma           1.2;
    //     fieldInf        (3.0151 0 0);
    //     lInf            1;
    //     phi             phi;
    // }
    left
    {
        // type            zeroGradient;
        type            noSlip;
    }

    right
    {
        // type            zeroGradient;
        type            noSlip;
    }

    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
