detonation_initiation_convergence_order_test/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   8.3144626e3; // =R [kg/kmol]
    }
    thermodynamics
    {
        // Cp          6; // =gamma/(gamma-1), gamma = 1.2
        Cp          3.5; // =gamma/(gamma-1), gamma = 1.4
        Hf          0;
    }
    transport
    {
        mu          0.;
        Pr          1;  // Prandtl number = nu/alpha
    }
}

Sc      1;  // Schmidt number = nu/D

// ************************************************************************* //
