detonation_initiation_convergence_order_test/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     detonationFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

// endTime         0.4;  // everything is still smooth
endTime         3.0;  // detonation !!!

deltaT          1e-4;

writeControl    adjustable;

writeInterval   1e-1;

purgeWrite      0;

writeFormat     binary;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   16;

runTimeModifiable true;

adjustTimeStep  yes;

// maxCo           0.1;
maxCo           1e-2;

// maxDeltaT       1;
maxDeltaT       0.0005;

graphFormat 	raw;

// DebugSwitches
// {
//     adaptive   0;
// }


// ************************************************************************* //
